print('Домашнее задание Тайранов.А')

print('Задача №1')
print('Введите', '"Я живу на планете Земля"')
ex1=input()
print(ex1)

print('Задача №2')
ex2=input('Введите три любых слова через пробел')
ex21=ex2.replace(' ', '!')
print(ex21)

print('Задача №3')
print('Три слова из букв слова "Информатика"')
ex3_text='Информатика'
print(ex3_text[2:7:1])
print(ex3_text[2:8:1])
print(ex3_text[7:-1:1])

print('Задача №4')
print('Введите три числа')
print('Введите первое число')
ex41=int(input())
print('Введите второе число')
ex42=int(input())
print('Введите третье число')
ex43=int(input())
ex44=(ex41+ex42+ex43)**2
ex45=(ex41-ex42-ex43)**2
print('Квадрат суммы трех чисел', ex44)
print('Квадрат разности трех чисел', ex45)